Revit 2027 API
AnalysisDisplayDeformedShapeSettings Constructor
 Constructs a default instance of deformed shape settings.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalysisDisplayDeformedShapeSettings()
Public Sub New
public:
AnalysisDisplayDeformedShapeSettings()
new : unit -> AnalysisDisplayDeformedShapeSettings
See Also
Reference
AnalysisDisplayDeformedShapeSettings Class
AnalysisDisplayDeformedShapeSettings Overload
Autodesk.Revit.DB.Analysis Namespace